# DirectContext3DHandleSettings Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectContext3DHandleSettings Class
Members See Also
---
Overriding settings applied to DirectContext3DHandles through the Visibility dialog.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class DirectContext3DHandleSettings : IDisposable
```

Visual Basic
---
```text
Public Class DirectContext3DHandleSettings _
	Implements IDisposable
```

Visual C++
---
```text
public ref class DirectContext3DHandleSettings : IDisposable
```

# Remarks
DirectContext3D graphics can be displayed with or without an associated DirectContext3D handle element. For DirectContext3D graphics that utilize the handle element, the visibility and appearance of the graphics can be adjusted through the Visibility/Graphics dialog.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.DirectContext3D..::..DirectContext3DHandleSettings
# See Also
DirectContext3DHandleSettings Members
Autodesk.Revit.DB.DirectContext3D Namespace